"""
@Author : jiaojie
@Time : 2020/4/6 14:42
@Desc : 
"""

"""
一、有5道题（通过字典来操作）：
    1. 某比赛需要获取你的个人信息，设计一个程序，
    运行时分别提醒输入 姓名、性别、年龄，输入完了，请将数据存储起来
    2. 数据存储完了，然后输入个人介绍，格式如下：
    我的名字xxx，今年xxx岁，性别xx，喜欢敲代码
    3.有一个人对你很感兴趣，平台需要您不足您的身高和联系方式
    4.平台为了保护你的隐私，需要你删除你的联系方式
    5.你为了取得更好的成绩，你添加了自己的擅长技能，至少需要3项

二、当前有一个列表li = [11,22,33,22,22,44,55,77,88,99,11]请统计列表不重复的元素个数
"""

print("============================第一题=============================")
dict = {}

dict['name'] = input("请输入你的姓名：")
dict['gender'] = input("请输入你的性别：")
dict['age'] = input("请输入你的年龄：")

print(dict)

print(("我的名字{name}，今年{age}岁，性别{gender}，喜欢敲代码").format(name= dict['name'],age = dict['age'],gender=dict.get('gender')))

dict['height'] = 150
dict['tele'] = '1888888888'

print(dict)

dict.pop('tele')

print(dict)

dict.update({'hobby':[1,2,3]})

print(dict)

print("============================第二题=============================")
li = [11,22,33,22,22,44,55,77,88,99,11]
li = list(set(li))
print(len(li))

